
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачисления.ДатаОкончания;
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
		Движение.Результат = 0;
		Движение.График = ТекСтрокаОсновныеНачисления.График;
		Движение.Подразделение = ТекСтрокаОсновныеНачисления.Подразделение;
	КонецЦикла; 
	
	Движения.Записать();
	
	НаборОсн = РегистрыРасчета.ОсновныеНачисления.СоздатьНаборЗаписей();
	НаборОсн.Отбор.Регистратор.Установить(Ссылка);
	НаборОсн.Прочитать();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ДанныеГрафика.ВидРасчета КАК ВидРасчета,
		|	ДанныеГрафика.Сотрудник КАК Сотрудник,
		|	ДанныеГрафика.ЗначениеПериодДействия КАК План,
		|	ДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
		|	ЕСТЬNULL(СведенияОСотрудникахСрезПоследних.Оклад, 0) КАК Оклад
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор) КАК ДанныеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСотрудниках.СрезПоследних КАК СведенияОСотрудникахСрезПоследних
		|		ПО ДанныеГрафика.Сотрудник = СведенияОСотрудникахСрезПоследних.Сотрудник";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Поиск = Новый Структура("НомерСтроки", 0);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Для каждого Запись Из НаборОсн Цикл
		
	    Поиск.НомерСтроки = Запись.НомерСтроки;
		
		Если Выборка.НайтиСледующий(Поиск) Тогда
		
			 Запись.Результат = ?(Выборка.Факт = 0, 0, Выборка.Оклад / Выборка.План * Выборка.Факт);
		
		КонецЕсли;
	    Выборка.Сбросить();
	КонецЦикла;
	
	Наборосн.Записать();
	
	Движения.Допначисления.Записывать = Истина;
	Для Каждого ТекСтрока Из ДопНачисления Цикл
		Движение = Движения.Допначисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрока.ВидРасчета;
		Движение.БазовыйПериодНачало = ТекСтрока.ДатаНачалаБаза;
		Движение.БазовыйПериодКонец = ТекСтрока.ДатаОкончанияБаза;
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.Сотрудник = ТекСтрока.Сотрудник;
		Движение.Результат = 0;
		//Движение.Подразделение = ТекСтрока.Подразделение;
	КонецЦикла; 

	Движения.Записать();;	

	Набордоп = РегистрыРасчета.Допначисления.СоздатьНаборЗаписей();
	НаборДоп.Отбор.Регистратор.Установить(Ссылка);
	НаборДоп.Прочитать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	База.НомерСтроки КАК НомерСтроки,
		|	База.ВидРасчета КАК ВидРасчета,
		|	База.Сотрудник КАК Сотрудник,
		|	База.РезультатБаза КАК РезультатБаза,
		|	ЕСТЬNULL(ПроцентОтСтажа.Ставка, 0) КАК Процент
		|ИЗ
		|	РегистрРасчета.Допначисления.БазаОсновныеНачисления(&Измерение, &Измерение, , Регистратор = &Регистратор) КАК База
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентОтСтажа КАК ПроцентОтСтажа
		|		ПО База.Сотрудник.Стаж >= ПроцентОтСтажа.От
		|			И База.Сотрудник.Стаж < ПроцентОтСтажа.До";
	
	
	Измерение = новый Массив(); 
	
	Измерение.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерение", Измерение);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Поиск = Новый Структура("НомерСтроки", 0);
	
	Для каждого Запись Из НаборДоп Цикл
	    Поиск.НомерСтроки = Запись.НомерСтроки;
		Если Выборка.НайтиСледующий(Поиск) Тогда	
			 Запись.Результат = ?(Выборка.РезультатБаза = 0, 0, Выборка.РезультатБаза / 100 * Выборка.Процент);
		     Запись.Процент = Выборка.Процент;
		КонецЕсли;	
	    Выборка.Сбросить();
	КонецЦикла;
	
	НаборДоп.Записать();
	
КонецПроцедуры
